#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:nil todo:t |:t
#+TITLE: Dust wave case studies
#+AUTHOR: William Henney
#+EMAIL: will@henney.org
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport


Case studies of interesting objects for inclusion in bow paper II

**** Info from Gaia
+ [[file:1528254812272O-result.json]]
+ Extracted and derived data
  | Quantity        | Unit       |               Value |
  |-----------------+------------+---------------------|
  | source_id       |            | 3017360348171372672 |
  | ra              | deg        |   83.79099195922022 |
  | ra_error        | mas        | 0.04624738839693305 |
  | dec             | deg        |  -5.464774673154743 |
  | dec_error       | mas        | 0.04518707614040293 |
  | parallax        | mas        |   2.447378178564449 |
  | parallax_error  | mas        | 0.06419465488526256 |
  | pmra            | mas.yr**-1 |  1.4821304012919858 |
  | pmra_error      | mas.yr**-1 | 0.11623231572816041 |
  | pmdec           | mas.yr**-1 |  1.6097056019763252 |
  | pmdec_error     | mas.yr**-1 | 0.09540261483321187 |
  | phot_g_mean_mag | mag        |            8.325929 |
  | bp_rp           | mag        |           0.3084631 |
  | a_g_val         | mag        |              0.4895 |
  |-----------------+------------+---------------------|
  | PA of pm        | deg        |        42.6 +/- 2.8 |
  | Total pm        | mas.yr**-1 |       2.19 +/- 0.11 |
  | V(tangential)   | km/s       |         4.2 +/- 0.2 |
  | D               | pc         |      408.6 +/- 10.7 |
  | RA              | hms        |   5@ 35' 9.8380702" |
  | Dec             | hms        |  -5@ 27' 53.188823" |
  #+TBLFM: @16$3=arctan(@9 +/- @10 / @11 +/- @12);f1::@17$3=sqrt((@9 +/- @10)**2 + (@11 +/- @12)**2);f2::@18$3=4.74 @-1 / (@7 +/- @8) ; f1::@19$3=1000/(@7 +/- @8) ; f1::@20$3=hms(@3/15)::@21$3=hms(@5)
+ [X] Check that this is the correct star!
  + 83.79099195922022, -5.464774673154743
    + 5@ 35' 9.8380702"
    + -5@ 27' 53.188823"
    + => 098-753 in OW notation
    + So this is consistent with the Spitzer position
+ So it is moving in roughly the right direction, but very slowly!
+ So, if it is a bow shock it must be an ambient flow - say 20 km/s
****** The Ha images
+ There are Ha, r, and i images
  + All the pointings are very similar
  + Each has 4 fields as compressed images in fits file
  + Number 4 is the one that shows the bow shock
+ They do not have useful WCS headers, but I have saved approximate values in [[file:data/Sigma-Ori/ING/4734/align-647195-ext4.wcs]]

#+BEGIN_SRC python :results output verbatim
  from astropy.io import fits

  hdulist = fits.open("data/Sigma-Ori/ING/4734/int20081118_00647195.fits.fz")

  hdulist.info()
#+END_SRC

#+RESULTS:
: Filename: data/Sigma-Ori/ING/4734/int20081118_00647195.fits.fz
: No.    Name      Ver    Type      Cards   Dimensions   Format
:   0  PRIMARY       1 PrimaryHDU     103   ()      
:   1  COMPRESSED_IMAGE    1 CompImageHDU     44   (2154, 4200)   int16   
:   2  COMPRESSED_IMAGE    2 CompImageHDU     44   (2154, 4200)   int16   
:   3  COMPRESSED_IMAGE    3 CompImageHDU     44   (2154, 4200)   int16   
:   4  COMPRESSED_IMAGE    4 CompImageHDU     44   (2154, 4200)   int16   


+ Add WCS info and split out the individual fields
#+BEGIN_SRC python :results output verbatim
  import glob
  from astropy.io import fits

  BIAS = 2210.5 
  filenames = glob.glob("data/Sigma-Ori/ING/4734/int20081118_*.fits.fz")

  for fn in filenames:
      hdulist = fits.open(fn)
      for ext, hdu in enumerate(hdulist):
          if 'IMAGE' in hdu.name:
              ohdu = fits.PrimaryHDU(header=hdulist[0].header,
                                     data=hdulist[ext].data - BIAS)
              ohdu.writeto(fn.replace(".fits.fz", f"-{ext}.fits"), overwrite=True)



#+END_SRC

#+RESULTS:



+ Try and take ratio of Ha to R, which should be more or less proportional to EW
  + Also need to remove bias, which can get from strips - first and last 50 pixels in X
  + Exposure times: 300s for Ha, 90s for r and i

#+BEGIN_SRC python :results output verbatim
  from astropy.io import fits

  # [Ha, R] image IDs
  pairs = [[176, 177],
           [180, 183],
           [185, 186],
           [188, 190],
           [192, 193],
           [195, 196],
           [198, 199],
           [201, 202],
           [204, 205],
           [207, 208],
           [210, 211],
  ]

  prefix = "data/Sigma-Ori/ING/4734/int20081118_00647"
  for id_ha, id_r in pairs:
      fn_ha = f"{prefix}{id_ha}-4.fits"
      fn_r = f"{prefix}{id_r}-4.fits"
      hdu_ha, = fits.open(fn_ha)
      hdu_r, = fits.open(fn_r)
      hdu_ha.data /= hdu_r.data
      hdu_ha.writeto(fn_ha.replace(".fits", "-ratio.fits"))
    

#+END_SRC

#+RESULTS:




***** 2MASS Near infrared
#+BEGIN_SRC python :results output
  from astropy.io import fits

  hdulist = fits.open("data/Carina/2MASS/2MASXJ10435514-5933326.fits")

  hdulist.info()
#+END_SRC

#+RESULTS:
: Filename: data/Carina/2MASS/2MASXJ10435514-5933326.fits
: No.    Name      Ver    Type      Cards   Dimensions   Format
:   0  PRIMARY       1 PrimaryHDU      51   (301, 301, 6)   float32   

***** Apex sub-mm
#+BEGIN_SRC python :results output
  from astropy.io import fits

  hdulist = fits.open("data/Carina/Apex/APEXBOL.2011-06-30T20:26:32.000.fits")

  hdulist.info()
#+END_SRC

#+RESULTS:
: Filename: data/Carina/Apex/APEXBOL.2011-06-30T20:26:32.000.fits
: No.    Name      Ver    Type      Cards   Dimensions   Format
:   0  PRIMARY       1 PrimaryHDU      39   ()      
:   1  SCAN-MBFITS    1 BinTableHDU    127   1R x 1C   [17A]   
:   2  FEBEPAR-MBFITS    1 BinTableHDU    121   1R x 23C   [1J, 1J, 1PJ(39), 1PJ(39), 1PJ(39), 39D, 39D, J, 39A, 39E, 39E, 39E, 39E, 39E, 39E, 39E, 1E, 1E, 39E, 39E, 39E, 1E, 1E]   
:   3  DATAPAR-MBFITS    1 BinTableHDU     86   16967R x 28C   [D, D, D, J, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D, D]   
:   4  ARRAYDATA-MBFITS    1 BinTableHDU     59   16967R x 2C   [D, 39E]   
:   5  MONITOR-MBFITS    1 BinTableHDU     30   163439R x 4C   [D, 30A, 1PD(28), 1PA(60)]   




*** Cross checking the fluxes of the EROs
+ The fluxes given in Sexton:2015a paper are much larger than in Kobulnicky:2017a
+ I want to find out which is right, using the IRAC4 8 micron image
  + Units are MJy/sr = 2.35043863818e-5 Jy/arcsec^2
  + IRAC pixels are 0.6 arcsec => 8.46e-6 Jy/pixel
  + MIPS pixels are 2.45 arcsec
+ Worked example: ERO 21 IRAC4
  + 10h 44m 05.00s -59d 33m 40.0s Equ J2000
  + Peak intensity: 1800
  + BG intensity: 250
  + Pixel Widths: 11 x 25
  + Total flux: 8.46e-6 11 25 (1800 - 250) = 3.61 Jy
+ Measure some more
  | Source | Band       |    \mu{}m |  Peak | BG             |    Bunit | Size  | Sunit | Flux                 | BG in MJy/sr    |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  |        | IRAC 2     | 4.493 |     7 | 5 +/- 1.5      |  2.35e-5 | 7*21  |   0.6 | 0.0025 +/- 0.0019    | 5. +/- 2.       |
  |        | IRAC 3     | 5.731 |    30 | 17 +/- 4       |  2.35e-5 | 7*21  |   0.6 | 0.0162 +/- 0.0050    | 17. +/- 4.      |
  |        | IRAC 3     | 5.731 |    27 | 17 +/- 4       |  2.35e-5 | 5*24  |     1 | 0.0282 +/- 0.0113    | 17. +/- 4.      |
  | ERO 5  | IRAC 4     | 7.872 |   170 | 65 +/- 5       |  2.35e-5 | 7*21  |   0.6 | 0.1306 +/- 0.0062    | 65. +/- 5.      |
  |        | IRAC 4     | 7.872 |   147 | 65 +/- 5       |  2.35e-5 | 5*24  |     1 | 0.2312 +/- 0.0141    | 65. +/- 5.      |
  |        | WISE 3     |    12 |  5600 | 2200 +/- 200   |  2.35e-5 | 5*24  |     1 | 9.5880 +/- 0.5640    | 2200. +/- 200.  |
  |        | WISE 4     |    22 |  1100 | 600  +/- 100   |  2.35e-5 | 5*24  |     1 | 1.4100 +/- 0.2820    | 600. +/- 100.   |
  |        | MIPS 1     | 23.68 |  1145 | 400 +/- 100    |  2.35e-5 | 5*24  |     1 | 2.1009 +/- 0.2820    | 400. +/- 100.   |
  |        | PACS 70    |    70 | 0.475 | 0.45 +/- 0.02  | 1/3.2**2 | 5*24  |     1 | 0.2930 +/- 0.2344    | 1870. +/- 83.   |
  |        | PACS 150   |   150 |  0.42 | 0.42 +/- 0.02  | 1/3.2**2 | 5*24  |     1 | 0.0000 +/- 0.2344    | 1745. +/- 83.   |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  |        | IRAC 2     | 4.493 |    83 | 10 +/- 6       |  2.35e-5 | 11*25 |   0.6 | 0.1698 +/- 0.0140    | 10. +/- 6.      |
  |        | IRAC 3     | 5.731 |   720 | 55 +/- 5       |  2.35e-5 | 11*25 |   0.6 | 1.5471 +/- 0.0116    | 55. +/- 5.      |
  | ERO 21 | IRAC 4     | 7.872 |  1950 | 250 +/- 50     |  2.35e-5 | 11*25 |   0.6 | 3.9551 +/- 0.1163    | 250. +/- 50.    |
  |        | PACS 70    |    70 |   6.0 | 1.5 +/- 0.5    | 1/3.2**2 | 5*6   |   3.2 | 135.0000 +/- 15.0000 | 6233. +/- 2078. |
  |        | PACS 160   |   160 |   2.5 | 1.0 +/- 0.2    | 1/3.2**2 | 5*6   |   3.2 | 45.0000 +/- 6.0000   | 4156. +/- 831.  |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  |        | IRAC 4     | 7.872 |    47 | 40 +/- 4       |  2.35e-5 | 12*40 |     1 | 0.0790 +/- 0.0451    | 40. +/- 4.      |
  |        | WISE 3     |    12 |  1830 | 1100 +/- 100   |  2.35e-5 | 20*40 |     1 | 13.7240 +/- 1.8800   | 1100. +/- 100.  |
  |        | WISE 4     |    22 |   430 | 280 +/- 30     |  2.35e-5 | 20*40 |     1 | 2.8200 +/- 0.5640    | 280. +/- 30.    |
  | ERO 36 | MIPS 1     | 23.68 |   427 | 120 +/- 20     |  2.35e-5 | 12*40 |     1 | 3.4630 +/- 0.2256    | 120. +/- 20.    |
  |        | PACS 70    |    70 |  0.32 | 0.24 +/- 0.01  | 1/3.2**2 | 20*40 |     1 | 6.2500 +/- 0.7813    | 997. +/- 42.    |
  |        | PACS 160   |   160 | 0.265 | 0.23  +/- 0.01 | 1/3.2**2 | 20*40 |     1 | 2.7344 +/- 0.7813    | 956. +/- 42.    |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  | ERO 37 | PACS B     |    70 |       |                |          |       |       | 0                    | 0e0             |
  |        | WISE 4     |    22 |       |                |          |       |       | 0                    | 0e0             |
  |        | Akari L15  |    15 |       |                |          |       |       | 0                    | 0e0             |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  | ERO 29 | PACS B     |    70 |       |                |          |       |       | 0                    | 0e0             |
  |        |            |       |       |                |          |       |       | 0                    | 0e0             |
  |--------+------------+-------+-------+----------------+----------+-------+-------+----------------------+-----------------|
  | ERO 16 | Akari L24  |       |       |                |          |       |       | 0                    | 0e0             |
  |        | Akari L18W |       |       |                |          |       |       | 0                    | 0e0             |
  |        | Akari L15  |       |       |                |          |       |       | 0                    | 0e0             |
  #+TBLFM: $9=$6 ($4 - $5) $7 $8**2 ; f4::$10=$5 $6 / 2.35e-5 ; f0
  + ~Bunit~ is brightness unit Jy/arcsec^2
    + 2.3504e-5 for MJy/sr
  + ~Punit~ is size unit in arcsec
  + Note that the second lot of IRAC fluxes are smoothed to the MIPS resolution and using a slightly bigger aperture
  + Herschel PACS images are in Jy/pixel
    + Pixel is 3.2 arcsec
+ ERO 29 strangeness
  + Listed as very small in Sexton:2015a: size 16.6, offset 5.2 arcsec
  + But is actually large: offset 100 arcsec!
+ ERO 16 show up clearly in Akari
  + It is seen in all 3 MIR bands, but strongest in L24
  + I measure R0 = 20 arcsec, R90 = 45 arcsec
  + Sexton:2015a had it being circular and 7.4 arcsec
  + There are several observations of similar field, for instance
    + file:data/Carina/Akari/MIR/AKARI_IRC_6171001_001_201503/
    + file:data/Carina/Akari/MIR/AKARI_IRC_6171002_001_201503/
    + Data are in the ~stacked_IM~ directory
    + Note that I had to correct the WCS to align the 3 bands with each other and with the catalog position of ERO 16
      + Need to apply files such as [[file:data/Carina/Akari/MIR/AKARI_IRC_6171002_001_201503/6171002_001_L15_long.wcs][6171002_001_L15_long.wcs]]
+ What about WISE?
  + Pixel size 1.375 arcsec
  + ~BUNIT~ says that intensity is in ~DN~, which isn't helpful
  + We could calibrate IRAC 4 against MIPS 1 with ERO 36
+ We also have Akari - but very low resolution
  + FIR is only useful for ERO 29, but MIR is much better (although spotty coverage)
    + See ERO 16 discussion above
  + FIR Bands:
    + N60 :: 65 micron
    + Wide S :: 90 micron
    + Wide L :: 140 micron
    + N160 :: 160 micron
  + MIR bands
    + 15, 18, 24 micron
+ Possible new bow shock
  + WERO 40
  + 10:47:11.68 -60:20:48.73
  + Detected in Akari, but there is only L15 observations of the field
    + Example: [[file:data/Carina/Akari/MIR/AKARI_IRC_6170001_001_201503/stacked_IM/6170001_001_L15_long.fits]]
    + Also 6170005, and 6170006
+ ERO 37 also show up in Akari L15
  + 1650296_001
*** Densities and column densities
+ Kobulnicky:2018a find the stream density by
  1. Converting the 70 micron emission to column density, using Draine:2007a
  2. Using measured chord length to convert this into shell density
  3. Assume density jump of 4 across the shock to find the pre-shock density
+ Step 3 is the most problematic, since this only applies if the shock is non-radiative
  + For O9 and above, shock is strongly radiative above n = 1 for V = 30 km/s
  + So compression should be M^2 = 9, which is twice as high
+ Conclusion: stream densities should be 2 times lower, which implies /two times lower mass loss rates/
  + But we eliminate dependence on the stream velocity, since shell density is proportional to V^2, exactly the same as external ram pressure
+ We could also do an alternative method based on the column density
  + This requires knowing the shell thickness ratio, H/R, so we can estimate the limb brightening
  + Observed column from 70 micron surface brightness is n_1 L, where L is the chord length
  + Then use n_1 H = 3/4 n_0 R
+ Relating 70 micron emission to column density
  + Quantity j_\nu gives conversion: S_70 = j_\nu N_H
  + S_70 = 8e8 Jy/sr for brightest
  + j_\nu = about 1e-11, depending on radiation field at shell
  + => N_H = 1e20 H cm^-2
    + => \tau = 0.13
  + But this is across the chord length - the thickness will be less by a factor of 5-10, so \tau < 0.026
  + We can actually work it all out from the real data
    + Compare \tau and \eta as calculated from Kobulnicky:2018a data
    + The "radius" R and thickness H is given in the previous paper Kobulnicky:2017a
      + But note that R is not R0, but more like R90 (although as far as I can see, it is not measured from the star)
    + They also have a table with the R0 values (Kobulnicky:2017a Table 5) for just the sub-sample of known distance
      + But there are some inconsistencies:
        + Source 13 (zeta Oph): 29 (K17) versus 299 (K18) arcsec.  Clearly the second is correct
        + Source 331: 25 vs 42
        + Source 381: 71 vs 220
        + I will take the second one (K18) in all cases
    + Better idea - work out the optical depth from \tau = 2 L_{IR} / L_{*}

#+name: kob18
|  ID |    L4 |   V3 |    R0 |    S7 | R0_as |  l_as | l/R0 | j_-12 | D_kpc | FIR_-9 |  L*/LIR |
|-----+-------+------+-------+-------+-------+-------+------+-------+-------+--------+---------|
|  13 |   8.1 |  1.3 | 0.175 |  12.3 |   299 |   277 | 0.93 |   8.7 |  0.11 |   64.0 | 3339.43 |
|  67 |   5.1 |  1.3 | 0.080 |  64.0 |   7.5 |    15 | 2.00 |  11.0 |  1.99 |   58.0 |    7.09 |
| 329 |   7.9 |  2.0 | 0.219 |  15.4 |    10 |    27 | 2.70 |   8.4 |   4.1 |   0.51 |  294.20 |
| 331 |  12.0 |  2.5 | 0.296 |  12.0 |    42 |    55 | 1.31 |   8.3 |  1.32 |    5.3 |  414.87 |
| 338 |   7.9 |  1.2 | 0.162 |  79.8 |    23 |    29 | 1.26 |   8.9 |  1.32 |    6.9 |  209.79 |
| 339 |  32.0 |  2.9 | 0.493 |  29.9 |    70 |    47 | 0.67 |   8.3 |  1.32 |    6.0 |  977.24 |
| 341 |   5.1 |  1.3 | 0.141 |   5.0 |    20 |    31 | 1.55 |   8.7 |  1.32 |    1.9 |  491.84 |
| 342 |   1.4 |  0.8 | 0.070 |  57.8 |    10 |    14 | 1.40 |   8.9 |  1.32 |   0.60 |  427.54 |
| 344 |  87.0 |  3.0 | 1.359 |  58.6 |   193 |   170 | 0.88 |   8.0 |  1.32 |   50.0 |  318.83 |
| 368 |   4.1 |  1.2 | 0.146 |  24.9 |    14 |    22 | 1.57 |   8.5 |  1.95 |   0.14 | 2458.89 |
| 369 |   9.7 |  2.5 | 0.759 |   7.9 |    73 |    39 | 0.53 |   7.8 |  1.95 |    1.4 |  581.74 |
| 380 |   2.6 |  1.2 | 0.021 |  35.7 |    15 |    49 | 3.27 |  30.0 |  0.26 |    3.3 | 3721.05 |
| 381 |  12.0 |  2.5 | 0.739 |   4.6 |   220 |   200 | 0.91 |   7.9 |  0.63 |    4.4 | 2193.81 |
| 382 |  12.0 |  1.2 | 0.506 |  11.2 |   101 |    70 | 0.69 |   8.0 |  0.94 |    3.2 | 1354.96 |
| 406 |   8.2 |  1.3 | 0.201 |  29.1 |    16 |    26 | 1.63 |   8.5 |  2.35 |    1.9 |  249.50 |
| 407 |  14.0 |  1.3 | 0.098 |  58.2 |   7.8 |    25 | 3.21 |  13.0 |  2.35 |    6.3 |  128.47 |
| 409 |   7.4 |  1.2 | 0.093 |  20.8 |   7.4 |    17 | 2.30 |  11.0 |  2.35 |   0.76 |  562.90 |
| 410 |   4.1 |  1.2 | 0.046 |  91.4 |   3.7 |    14 | 3.78 |  15.0 |  2.35 |    1.1 |  215.48 |
| 411 |   4.1 |  1.2 | 0.052 |  41.5 |   4.2 |    16 | 3.81 |  13.0 |  2.35 |   0.40 |  592.57 |
| 413 |   5.1 |  1.3 | 0.188 |  15.4 |    15 |    24 | 1.60 |   8.3 |  2.35 |    1.0 |  294.84 |
|-----+-------+------+-------+-------+-------+-------+------+-------+-------+--------+---------|
|     | 12.49 | 1.62 |  0.29 | 33.78 | 57.58 | 58.35 | 1.80 | 10.51 |  1.70 |  10.86 |  941.75 |
|     | 18.70 | 0.67 |  0.33 | 26.12 | 83.72 | 71.69 | 1.04 |  5.02 |  0.91 |  20.27 | 1099.22 |
#+TBLFM: $8=$-1/$-2;f2::$12=1e4 $2 $Lsun / (4 $pi ($-2 1000 $pc)**2 1e-9 $-1) ; f2::@22$2..@22$12=vmean(@I..@II);f2::@23$2..@23$12=vsdev(@I..@II);f2

#+BEGIN_SRC python :var TAB=kob18 :colnames no :return tab
  from astropy.table import Table
  tab = Table(rows=TAB[1:-2], names=TAB[0])
  tab.write('kob18.fits')
#+END_SRC

#+RESULTS:
#+begin_example
ID  L4   V3   R0   S7  R0_as l_as l/R0 j_-12 D_kpc FIR_-9  L*/LIR
--- ---- --- ----- ---- ----- ---- ---- ----- ----- ------ -------
 13  8.1 1.3 0.175 12.3 299.0  277 0.93   8.7  0.11   64.0 3339.43
 67  5.1 1.3  0.08 64.0   7.5   15  2.0  11.0  1.99   58.0    7.09
329  7.9 2.0 0.219 15.4  10.0   27  2.7   8.4   4.1   0.51   294.2
331 12.0 2.5 0.296 12.0  42.0   55 1.31   8.3  1.32    5.3  414.87
338  7.9 1.2 0.162 79.8  23.0   29 1.26   8.9  1.32    6.9  209.79
339 32.0 2.9 0.493 29.9  70.0   47 0.67   8.3  1.32    6.0  977.24
341  5.1 1.3 0.141  5.0  20.0   31 1.55   8.7  1.32    1.9  491.84
342  1.4 0.8  0.07 57.8  10.0   14  1.4   8.9  1.32    0.6  427.54
344 87.0 3.0 1.359 58.6 193.0  170 0.88   8.0  1.32   50.0  318.83
368  4.1 1.2 0.146 24.9  14.0   22 1.57   8.5  1.95   0.14 2458.89
369  9.7 2.5 0.759  7.9  73.0   39 0.53   7.8  1.95    1.4  581.74
380  2.6 1.2 0.021 35.7  15.0   49 3.27  30.0  0.26    3.3 3721.05
381 12.0 2.5 0.739  4.6 220.0  200 0.91   7.9  0.63    4.4 2193.81
382 12.0 1.2 0.506 11.2 101.0   70 0.69   8.0  0.94    3.2 1354.96
406  8.2 1.3 0.201 29.1  16.0   26 1.63   8.5  2.35    1.9   249.5
407 14.0 1.3 0.098 58.2   7.8   25 3.21  13.0  2.35    6.3  128.47
409  7.4 1.2 0.093 20.8   7.4   17  2.3  11.0  2.35   0.76   562.9
410  4.1 1.2 0.046 91.4   3.7   14 3.78  15.0  2.35    1.1  215.48
411  4.1 1.2 0.052 41.5   4.2   16 3.81  13.0  2.35    0.4  592.57
413  5.1 1.3 0.188 15.4  15.0   24  1.6   8.3  2.35    1.0  294.84
#+end_example


+ Flux conversions:
  + 1 Jy = 1e-23 erg/s/cm^2/Hz
  + So we can find the total flux in erg/s/cm^2 by summing the
    spectral fluxes in Jy times bandwidths \Delta\nu in each band
    |          |  \mu{}m |   \Delta\nu Hz |
    |----------+-----+---------|
    | IRAC     |   8 | 1.45e13 |
    | MIPS     |  24 |  4.6e12 |
    | MIPS     |  70 |  1.2e12 |
    | MIPS     | 160 |  5.5e11 |
    | Herschel |  70 | 6.48e11 |
    | Herschel | 160 | 3.54e11 |
  + So, estimate for total flux in units of 1e-10 erg/cm^2/s
    + 1.45 S_8 + 0.46 S_24 + 0.0648 S_70 + 0.0354 S_160
  + But that leaves gaps in between the bands, so best to use the difference between bands as the \delta\nu:
    | \lambda, \mu{}m |  \nu, Hz |     \delta\nu | \langle \delta\nu \rangle |
    |-------+--------+--------+--------|
    |     5 | 6.0e13 | 2.3e13 | #ERROR |
    |     8 | 3.7e13 | 2.5e13 | 2.4e13 |
    |    24 | 1.2e13 | 7.7e12 | 1.6e13 |
    |    70 | 4.3e12 | 2.4e12 | 5.1e12 |
    |   160 | 1.9e12 | 1.6e12 |   2e12 |
    |  1000 | 3.0e11 |        |        |
    #+TBLFM: $2=$c / $1 $micron ;s2::$3=$-1 - @+1$-1::$4=(@-1$3 + $3)/2;s2
  + The third column is the forward difference, while fourth column is the centered difference, which should be better
  + So this would give a better total flux of
    + 2.4 S_8 + 1.6 S_24 + 0.51 S_70
    + Note that we are only using 3 bands
    + /Old version/:
      + 2.3 S_5 + 2.5 S_8 + 0.77 S_24 + 0.24 S_70 + 0.16 S_160
  + E.g., source 13 (subbing S_12 for S_8):
    + (2.3 8 + 2.5 51.32 + 0.77 343 + 0.24 246 + 0.16 62)
    + (18.4 + 128.3 + 264.11 + 59.04 + 9.92) = 479.77e-10 = 5e-8 as in Table!
  + And source 67
    + (2.3 0 + 2.5 0.31 + 0.77 27.66 + 0.24 4.4 + 0.16 5.4)
    + (0 + 0.775 + 21.2982 + 1.056 + 0.864) = 23.99e-10 = 2.4e-9
    + This is less than 5% of the 6e-8 in table! That seemed to be based on a very high-T fit, which cannot be right.
  + So, in both cases, over 90% of total IR flux comes from 8, 24, 70 micron bands
  + In K17 they give peak S(70) in Jy/arcmin^2, whereas in K18 it is in Jy/sr
    + Conversion factor is (180 60 / pi)**2 = 1.18e7

* Density versus velocity in photoevaporation flow
+ Assume isothermal:
  + 1/2 M^2 + ln n = 1/2 M_0^2 + ln n_0
  + n / n_0 = exp(-(M^2 - M_0^2)/2)

| M_0 | M |   n/n_0 | P/P_0 |
|-----+---+---------+-------|
|   1 | 2 | 0.22313 | 0.558 |
|   1 | 3 | 0.01832 | 0.092 |
|   1 | 4 | 0.00055 | 0.005 |
|   0 | 1 | 0.60653 | 1.213 |
|   0 | 2 | 0.13534 | 0.677 |
|   0 | 3 | 0.01111 | 0.111 |
|   0 | 4 | 0.00034 | 0.006 |
#+TBLFM: $3=exp(-($2**2 - $1**2)/2) ;f5::$4=$3 (1 + $2**2) / (1 + $1**2);f3
** Arc fit for LP Ori
#+BEGIN_SRC python :eval no :tangle arc-fits/lp-ori-circle-fit.py
  import sys 
  sys.path.append("/Users/will/Dropbox/circle-fit")
  import circle_fit

  fits_file = "../data/LP-Ori-HST/lp-ori-f435w.fits"

  for delta_theta in 110, 130, 150:
      plotfile = f"lp-ori-{delta_theta:03d}.pdf"
      print('#### '*10)
      print("Creating", plotfile)
      circle_fit.plot_solution(
          f"lp-ori-acs-forma.reg",
          fits_file,
          plotfile,
          delta_theta=delta_theta,
          vmin=0.0, vmax=8.0,
      )
#+END_SRC

#+BEGIN_SRC sh :results verbatim
cd arc-fits
python lp-ori-circle-fit.py
#+END_SRC

#+RESULTS:
#+begin_example
#### #### #### #### #### #### #### #### #### #### 
Creating lp-ori-110.pdf
CircleFit(Pi = 1.595, Lambda = 1.369, dLambda = 0.109)
CircleFit(Pi = 1.320, Lambda = 1.576, dLambda = -0.282)
CircleFit(Pi = 1.535, Lambda = 1.415, dLambda = -0.321)
CircleFit(Pi = 1.480, Lambda = 1.380, dLambda = -0.335)
#### #### #### #### #### #### #### #### #### #### 
Creating lp-ori-130.pdf
CircleFit(Pi = 1.595, Lambda = 1.369, dLambda = 0.109)
CircleFit(Pi = 1.315, Lambda = 1.546, dLambda = -0.180)
CircleFit(Pi = 1.386, Lambda = 1.411, dLambda = -0.286)
CircleFit(Pi = 1.360, Lambda = 1.458, dLambda = -0.242)
#### #### #### #### #### #### #### #### #### #### 
Creating lp-ori-150.pdf
CircleFit(Pi = 1.595, Lambda = 1.369, dLambda = 0.109)
CircleFit(Pi = 1.245, Lambda = 1.532, dLambda = -0.315)
CircleFit(Pi = 1.334, Lambda = 1.549, dLambda = -0.160)
CircleFit(Pi = 1.315, Lambda = 1.546, dLambda = -0.180)
#+end_example


** Arc fit for th1D
#+BEGIN_SRC python :eval no :tangle arc-fits/th1d-circle-fit.py
  import sys 
  sys.path.append("/Users/will/Dropbox/circle-fit")
  import circle_fit

  fits_file = "/Users/will/Dropbox/JorgeBowshocks/MIR/SmithBally/wcs.mos11jy.fits"

  for delta_theta in 65, 70, 75, 80:
      plotfile = f"th1D-{delta_theta:02d}.pdf"
      print('#### '*10)
      print("Creating", plotfile)
      circle_fit.plot_solution(
          f"th1d-ori-smith-2005-forma.reg",
          fits_file,
          plotfile,
          delta_theta=delta_theta,
          vmin=0.0, vmax=0.01,
      )
#+END_SRC

#+BEGIN_SRC sh :results verbatim
cd arc-fits
python th1d-circle-fit.py
#+END_SRC

#+RESULTS:
#+begin_example
#### #### #### #### #### #### #### #### #### #### 
Creating th1D-65.pdf
CircleFit(Planitude = 1.863668610945027, Alatude = [ 1.5174858   1.47936061])
CircleFit(Planitude = 1.4369575034558033, Alatude = [ 1.34236887  1.37510133])
CircleFit(Planitude = 1.4369575034558033, Alatude = [ 1.34236887  1.37510133])
CircleFit(Planitude = 1.4369575034558033, Alatude = [ 1.34236887  1.37510133])
#### #### #### #### #### #### #### #### #### #### 
Creating th1D-70.pdf
CircleFit(Planitude = 1.863668610945027, Alatude = [ 1.5174858   1.47936061])
CircleFit(Planitude = 1.4078624613676836, Alatude = [ 1.33984663  1.3714574 ])
CircleFit(Planitude = 1.5558494149676698, Alatude = [ 1.37294133  1.38619122])
CircleFit(Planitude = 1.5558494149676698, Alatude = [ 1.37294133  1.38619122])
#### #### #### #### #### #### #### #### #### #### 
Creating th1D-75.pdf
CircleFit(Planitude = 1.863668610945027, Alatude = [ 1.5174858   1.47936061])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
#### #### #### #### #### #### #### #### #### #### 
Creating th1D-80.pdf
CircleFit(Planitude = 1.863668610945027, Alatude = [ 1.5174858   1.47936061])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
CircleFit(Planitude = 1.5029029947873929, Alatude = [ 1.37811972  1.38004071])
#+end_example

Do the bootstrap resampling
#+BEGIN_SRC sh :eval no
cd arc-fits
python ~/Dropbox/circle-fit/plot-bootstrap.py th1d-ori-smith-2005-forma.reg ~/Dropbox/JorgeBowshocks/MIR/SmithBally/wcs.mos11jy.fits 75 0.5 bootstrap-th1d-75-05.pdf
#+END_SRC
